import React, {Component} from 'react';

const isMobile = window.innerWidth <= 1024;
const styles = {
    button: {
        margin: 50,
    },
    exampleImageInput: {
        cursor: 'pointer',
        position: 'absolute',
        top: 0,
        bottom: 0,
        right: 0,
        left: 0,
        width: '100%',
        opacity: 0,
    },
    offsetMobile:{
        fontSize: 18
    },
    pStyleMoving:{
        fontSize: 15
    }
};

class SectionFirst extends Component {
    render() {
        return (
            <div id="sectionFirst">
                <div id="video-placeholder">
                    <WebLogo/>
                    <div id="sectionFirstH1">
                        <TextParallax/>
                    </div>
                </div>
            </div>
        );
    }
}
export default SectionFirst;


const RaisedButtonComplex = () => (
    <div>
        <a href="#order-form">
        <button className="sleeve" style={styles.button}>
            Оставить заявку
            <span className="insert arrow-bottom">
                <div className="arrow arrow-1"></div>
                <div className="arrow arrow-2"></div>
            </span>
        </button>
        </a>
    </div>
);

class TextParallax extends Component {
    constructor(props) {
        super(props);
        this.init();
    }
    init() {
        this.state = {
            mousePos: {x: 0, y: 0}
        }
    }
    mouseMove(e) {
        this.setState({
            mousePos: {
                x: e.pageX - (window.innerWidth / 2),
                y: e.pageY - (window.innerHeight / 2)
            }
        })
    }

    render() {
        let offset = {
            transform: `translate3d( ${this.state.mousePos.x / -100}px, ${this.state.mousePos.y / -100}px, 0 )`,
            textShadow: `${- this.state.mousePos.x / -90}px ${this.state.mousePos.y / 100}px rgba(0, 0, 0, 0.3)`
        }
        if (isMobile) {
            return (
                <div className='move'  onMouseMove={this.mouseMove.bind(this)}>
                    <h1><span className='moving' style={styles.offsetMobile}>Мы создаём веб-приложения</span> <p style={styles.pStyleMoving}
                    >Как создать веб-приложение? Просто - </p>  <RaisedButtonComplex/></h1>
                </div>
            );
        } else {
            return (
                <div className='move'  onMouseMove={this.mouseMove.bind(this)}>
                    <h1><span className='moving' style={offset}>МЫ СОЗДАЁМ ВЕБ-ПРИЛОЖЕНИЯ</span> <p>КАК СОЗДАТЬ ВЕБ-ПРИЛОЖЕНИЕ? ПРОСТО - </p>  <RaisedButtonComplex/></h1>
                </div>
            );
        }
    }
}

class WebLogo extends Component {
    render() {
        return (
        <div className="svgWebLogo">
            <svg
                version="1.0"
                x="0.00000000"
                y="0.00000000"
                viewBox="-648 -140 1406 366"
    id="svg2">
        <defs
            id="defs4" />
        <g
            id="layer1">
            <g
                transform="translate(-14.31153,-9.654345)"
                id="g2100">
                <path id="logo-globe"
                      d="M 77.5,1.1875 C 35.7,1.1875 1.59375,35.2 1.59375,77 c 0,41.8 34.00625,75.8125 75.90625,75.8125 0.408442,0 0.811834,-0.0252 1.21875,-0.0312 0.29062,0.0109 0.584299,0.0312 0.875,0.0312 0.941138,0 1.888948,-0.0737 2.8125,-0.1875 39.61376,-2.53298 71,-35.47082 71,-75.625 0,-40.154177 -31.38624,-73.0920222 -71,-75.625 -0.923552,-0.113755 -1.871362,-0.1875 -2.8125,-0.1875 -0.290701,0 -0.58438,0.020282 -0.875,0.03125 C 78.311834,1.212313 77.908442,1.1875 77.5,1.1875 z m 4.59375,10.1875 c 11.59887,3.356742 21.54101,19.427515 26,40.78125 -7.15388,0.573629 -15.772051,1.02517 -26,1.125 l 0,-41.90625 z m -9.5,0.125 0,41.78125 c -10.091811,-0.102429 -18.739805,-0.513666 -26,-1.0625 4.533034,-21.089501 14.531049,-37.048237 26,-40.71875 z M 54.8125,14.65625 C 47.093004,23.534751 40.784286,36.297714 37.34375,51.375 26.479137,50.20649 20.043813,48.828453 17.5625,48.21875 25.064402,32.723364 38.456958,20.583633 54.8125,14.65625 z M 104,16.1875 c 14.43192,6.26619 26.20846,17.478203 33.15625,31.5 -0.9906,0.288709 -6.83062,2.034226 -19.46875,3.53125 C 115.03295,37.063708 110.24216,24.940941 104,16.1875 z m 34.84375,35.15625 C 142.16985,59.23385 144,67.909121 144,77 c 0,8.642358 -1.66586,16.896029 -4.6875,24.46875 -2.54569,-0.76247 -9.11025,-2.41241 -20.78125,-3.78125 C 119.49012,91.131682 120,84.201346 120,77 c 0,-5.672937 -0.33413,-11.180964 -0.9375,-16.46875 14.66636,-1.743205 21.14728,-3.911819 21.625,-4.03125 l -1.84375,-5.15625 z m -124.75,5.6875 C 15.575409,57.426871 22.349118,59.150953 35.625,60.625 34.885319,65.883092 34.5,71.361807 34.5,77 c 0,7.166638 0.640331,14.065873 1.8125,20.59375 -11.178399,1.211676 -17.889692,2.63086 -20.84375,3.34375 C 12.579869,93.510534 11,85.440544 11,77 11,70.043052 12.097636,63.333011 14.09375,57.03125 z M 109.625,61.5 c 0.62244,4.988684 0.96875,10.183447 0.96875,15.5 0,6.857352 -0.54114,13.498776 -1.5625,19.78125 -7.45369,-0.602087 -16.375986,-1.055242 -26.9375,-1.15625 l 0,-32.96875 C 92.919866,62.552743 102.05817,62.123382 109.625,61.5 z M 45,61.53125 c 7.664507,0.603094 16.830504,1.018113 27.59375,1.125 l 0,32.96875 c -10.492007,0.104193 -19.454953,0.544834 -27,1.125 C 44.547387,90.489563 44,83.840879 44,77 44,71.694326 44.357799,66.510557 45,61.53125 z m 27.59375,43.5 0,37.46875 c -10.682045,-3.41867 -20.095244,-17.51244 -25,-36.46875 7.050331,-0.51916 15.366053,-0.9004 25,-1 z m 9.5,0 c 9.759193,0.0952 18.05561,0.49757 25.03125,1.03125 -4.83174,19.21111 -14.215407,33.42304 -25.03125,36.5625 l 0,-37.59375 z m -43.6875,1.8125 c 3.594292,13.24529 9.415501,24.45966 16.40625,32.5 -14.957814,-5.42083 -27.428491,-16.05878 -35.1875,-29.6875 3.418907,-0.72306 9.569591,-1.84742 18.78125,-2.8125 z m 78.4375,0.125 c 9.59178,1.09151 15.37616,2.34797 18.28125,3.09375 -7.09804,12.26145 -18.01047,22.05581 -31.125,27.75 5.61988,-7.88081 10.07514,-18.47953 12.84375,-30.84375 z" />
            </g>
        </g>
    </svg>
    </div>
        );
    }
}
